Documents/ОтражениеРасходовНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтражениеРасходовНаПерсонал</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтражениеРасходовНаПерсонал</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленнаяЗарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Взносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдержаннаяЗарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Займы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обучение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтражениеРасходовНаПерсонал/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		// ЗУПК
		// создается новый документ
		ЗначенияДляЗаполнения = Новый Структура("ПредыдущийМесяц, Ответственный", 
		"Объект.ПериодРегистрации",
		"Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		ПриПолученииДанныхНаСервере();
		ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// По умолчанию считаем, что после записи форму нужно закрыть, 
	// в связи с тем, что нельзя обработать событие закрытия в веб-клиенте.
	ЗакрыватьПослеЗаписи = Истина;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОписаниеТиповПроекты = Новый ОписаниеТипов("СправочникСсылка.Проекты");
	Элементы.НачисленнаяЗарплатаАналитикаРасходов.ОграничениеТипа = ОписаниеТиповПроекты;
	Элементы.ВзносыАналитикаРасходов.ОграничениеТипа = ОписаниеТиповПроекты;
	Элементы.УдержаннаяЗарплатаАналитикаРасходов.ОграничениеТипа = ОписаниеТиповПроекты;
	Элементы.ЗаймыАналитикаРасходов.ОграничениеТипа = ОписаниеТиповПроекты;
	Элементы.ОбучениеАналитикаРасходов.ОграничениеТипа = ОписаниеТиповПроекты;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Если документ проведен, то имитируем режим ПриЗаписиПерепроводить.
	Если Объект.Проведен И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПровестиДокумент();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
	Если Не ЗакрыватьПослеЗаписи Тогда
		// Признак необходимости закрытия держим постоянно взведенным.
		ЗакрыватьПослеЗаписи = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ОтражениеРасходовНаПерсонал", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ФормаДокументаГотоваДляЗаполнения() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнятьПоВсемПодразделениямПриИзменении(Элемент)
	
	УстановитьСвойстваПоляПодразделения();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПоОдномуПодразделениюПриИзменении(Элемент)
	
	УстановитьСвойстваПоляПодразделения();

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ПриИзмененииПодразделенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатьюАналитикуРасходовСтроки(ДанныеСтроки)
	
	СтатьяРасходовАналитика = СтатьяРасходовАналитикаПоУмолчанию(
								ДанныеСтроки.ФизическоеЛицо, 
								ДанныеСтроки.Подразделение, 
								ДанныеСтроки.НаправлениеДеятельности, 
								Объект.Ссылка, 
								Объект.Дата);
								
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтатьяРасходовАналитика);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленнаяЗарплатаФизическоеЛицоПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.НачисленнаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленнаяЗарплатаФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, Элементы.НачисленнаяЗарплатаФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура НачисленнаяЗарплатаФизическоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораФизическогоЛица(
		ВыбранноеЗначение, СтандартнаяОбработка, Элемент.Родитель.ТекущаяСтрока, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленнаяЗарплатаПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.НачисленнаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленнаяЗарплатаНаправлениеДеятельностиПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.НачисленнаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВзносыФизическоеЛицоПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Взносы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВзносыФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, Элементы.ВзносыФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ВзносыФизическоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораФизическогоЛица(
		ВыбранноеЗначение, СтандартнаяОбработка, Элемент.Родитель.ТекущаяСтрока, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВзносыПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Взносы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВзносыНаправлениеДеятельностиПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Взносы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УдержаннаяЗарплатаФизическоеЛицоПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.УдержаннаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УдержаннаяЗарплатаФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, Элементы.УдержаннаяЗарплатаФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура УдержаннаяЗарплатаФизическоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораФизическогоЛица(
		ВыбранноеЗначение, СтандартнаяОбработка, Элемент.Родитель.ТекущаяСтрока, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаннаяЗарплатаПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.УдержаннаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УдержаннаяЗарплатаНаправлениеДеятельностиПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.УдержаннаяЗарплата.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыФизическоеЛицоПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Займы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, Элементы.ЗаймыФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыФизическоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораФизическогоЛица(
		ВыбранноеЗначение, СтандартнаяОбработка, Элемент.Родитель.ТекущаяСтрока, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Займы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаймыНаправлениеДеятельностиПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Займы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеФизическоеЛицоПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Обучение.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, Элементы.ОбучениеФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеФизическоеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораФизическогоЛица(
		ВыбранноеЗначение, СтандартнаяОбработка, Элемент.Родитель.ТекущаяСтрока, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Обучение.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеНаправлениеДеятельностиПриИзменении(Элемент)
	ЗаполнитьСтатьюАналитикуРасходовСтроки(Элементы.Обучение.ТекущиеДанные);
КонецПроцедуры

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ФормаДокументаГотоваДляЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если Объект.НачисленнаяЗарплата.Количество() > 0
		Или Объект.Взносы.Количество() > 0
		Или Объект.УдержаннаяЗарплата.Количество() > 0
		Или Объект.Займы.Количество() > 0
		Или Объект.Обучение.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьЗаполнение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Табличные части документа будут очищены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе 
		НачатьЗаполнение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФормаДокументаГотоваДляЗаполнения()
	
	ФормаДокументаГотова = Истина;
	
	Если ЗаполнятьПоВсемПодразделениям = 0 И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ФормаДокументаГотова = Ложь;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо указать подразделение.'"), , "Подразделение", "Объект.Подразделение");
	КонецЕсли;
	
	Возврат ФормаДокументаГотова;
	
КонецФункции

&НаКлиенте
Процедура НачатьЗаполнение(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияЗаполнения();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение документа ""Отражение зарплаты в финансовом учете""'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьЗаполнение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗаполнения()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "Документы.ОтражениеРасходовНаПерсонал.ПодготовитьДанныеДляЗаполнения",
		Объект.Ссылка, Объект.Подразделение, Объект.ПериодРегистрации);
	
КонецФункции

&НаКлиенте
Процедура УстановитьСтатьиРасходовНачисленнаяЗарплата(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.НачисленнаяЗарплата, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВыделенныхСтрокНачисленнаяЗарплата(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.НачисленнаяЗарплата, Элементы.НачисленнаяЗарплата.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВзносы(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Взносы, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВыделенныхСтрокВзносы(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Взносы, Элементы.Взносы.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовУдержания(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.УдержаннаяЗарплата, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВыделенныхСтрокУдержания(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.УдержаннаяЗарплата, Элементы.Займы.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовЗаймы(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Займы, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВыделенныхСтрокЗаймы(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Займы, Элементы.Займы.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовОбучение(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Обучение, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВыделенныхСтрокОбучение(Команда)
	УстановитьСтатьиРасходовВТабличнойЧасти(Объект.Обучение, Элементы.Обучение.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеФормы(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровести(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	
	ПровестиДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровестиИЗакрыть(Команда)
	
	ПровестиДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриИзмененииПодразделенияНаСервере()
	
	Если СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникПодразделенияПредприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "Источник");
	ЭтоПодразделение = ТипЗнч(ИсточникПодразделенияПредприятия) = Тип("СправочникСсылка.ПодразделенияОрганизаций");
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
	
	СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц = ПолучитьФункциональнуюОпциюФормы("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц");
	
	ПриИзмененииПодразделенияНаСервере();
	
	ДоступноЗаполнениеПоВсемПодразделениям = ОтражениеРасходовНаПерсонал.ОтражениеРасходовНаПерсоналОднимДокументомПоВсемПодразделениямДоступно();
	
	Если Не ДоступноЗаполнениеПоВсемПодразделениям Тогда
		// Для потребителей, в которых не поддерживается отражение в финансовом учете по всем подразделениям
		// отключаем возможность управления режимом.
		Элементы.ЗаполнятьПоВсемПодразделениям.Видимость = Ложь;
		Элементы.ЗаполнятьПоОдномуПодразделению.Видимость = Ложь;
		Элементы.Подразделение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		ЗаполнятьПоВсемПодразделениям = 0;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ЗаполнятьПоВсемПодразделениям = 1;
	КонецЕсли;
	
	УстановитьСвойстваПоляПодразделения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент()
	
	ОчиститьСообщения();
	
	Если Объект.ПометкаУдаления Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Помеченный на удаление документ не может быть проведен.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьПередПроведением();
	НачатьПроведение();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПередПроведением()
	
	Если Не (Модифицированность Или Объект.Проведен) Тогда
		Возврат;
	КонецЕсли;
	
	// Преобразовываем данные формы в объект, чтобы записать его.
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Проведен = Ложь;
	ДокументОбъект.Записать();
	// После записи сразу же перечитываем объект, чтобы избежать различия версий.
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ПриПолученииДанныхНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроведение() Экспорт 
	
	ДлительнаяОперация = ДлительнаяОперацияПроведения();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Проведение документа ""Отражение зарплаты в финансовом учете""'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьПроведение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПроведения()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, "Документы.ОтражениеРасходовНаПерсонал.ВыполнитьПроведение", Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьПроведение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ПроведениеПослеВыполненияДлительнойОперации();
	ОповеститьОбИзменении(Объект.Ссылка);
	ПараметрыОповещения = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Оповестить("Запись_ОтражениеРасходовНаПерсонал", ПараметрыОповещения, Объект.Ссылка);
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	Иначе
		ЗакрыватьПослеЗаписи = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	АдресХранилища = Результат.АдресРезультата;
	ЗаполнениеПослеВыполненияДлительнойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПослеВыполненияДлительнойОперации()
	
	Объект.НачисленнаяЗарплата.Очистить();
	Объект.Взносы.Очистить();
	Объект.УдержаннаяЗарплата.Очистить();
	Объект.Займы.Очистить();
	Объект.Обучение.Очистить();
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОтраженияЗарплаты = Неопределено;
	Если СтруктураДанных.Свойство("РезультатОтраженияЗарплаты", РезультатОтраженияЗарплаты) Тогда
		// Перенесем данные в табличные части документа.
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатОтраженияЗарплаты.Зарплата, Объект.НачисленнаяЗарплата);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатОтраженияЗарплаты.СтраховыеВзносы, Объект.Взносы);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатОтраженияЗарплаты.УдержаннаяЗарплата, Объект.УдержаннаяЗарплата);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатОтраженияЗарплаты.Займы, Объект.Займы);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатОтраженияЗарплаты.Обучение, Объект.Обучение);
		
		ЗаполнитьСтатьиАналитикуРасходовПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроведениеПослеВыполненияДлительнойОперации()
	
	Если Не ЗакрыватьПослеЗаписи Тогда
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьиАналитикуРасходовПоУмолчанию()
	
	// Получаем последние используемые значения по совпадающим сочетаниям заполненных полей.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НачисленнаяЗарплата.ФизическоеЛицо,
	|	НачисленнаяЗарплата.Подразделение,
	|	НачисленнаяЗарплата.НаправлениеДеятельности,
	|	НачисленнаяЗарплата.СтатьяРасходов,
	|	НачисленнаяЗарплата.АналитикаРасходов
	|ПОМЕСТИТЬ ВТНачисленнаяЗарплата
	|ИЗ
	|	&НачисленнаяЗарплата КАК НачисленнаяЗарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ФизическоеЛицо,
	|	Взносы.Подразделение,
	|	Взносы.НаправлениеДеятельности,
	|	Взносы.СтатьяРасходов,
	|	Взносы.АналитикаРасходов
	|ПОМЕСТИТЬ ВТВзносы
	|ИЗ
	|	&Взносы КАК Взносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо,
	|	Удержания.Подразделение,
	|	Удержания.НаправлениеДеятельности,
	|	Удержания.СтатьяРасходов,
	|	Удержания.АналитикаРасходов
	|ПОМЕСТИТЬ ВТУдержаннаяЗарплата
	|ИЗ
	|	&УдержаннаяЗарплата КАК Удержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Займы.ФизическоеЛицо,
	|	Займы.Подразделение,
	|	Займы.НаправлениеДеятельности,
	|	Займы.СтатьяРасходов,
	|	Займы.АналитикаРасходов
	|ПОМЕСТИТЬ ВТЗаймы
	|ИЗ
	|	&Займы КАК Займы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обучение.ФизическоеЛицо,
	|	Обучение.Подразделение,
	|	Обучение.НаправлениеДеятельности,
	|	Обучение.СтатьяРасходов,
	|	Обучение.АналитикаРасходов
	|ПОМЕСТИТЬ ВТОбучение
	|ИЗ
	|	&Обучение КАК Обучение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленнаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленнаяЗарплата.Подразделение КАК Подразделение,
	|	НачисленнаяЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВТНезаполненнаяАналитика
	|ИЗ
	|	ВТНачисленнаяЗарплата КАК НачисленнаяЗарплата
	|ГДЕ
	|	НачисленнаяЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И НачисленнаяЗарплата.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Взносы.ФизическоеЛицо,
	|	Взносы.Подразделение,
	|	Взносы.НаправлениеДеятельности
	|ИЗ
	|	ВТВзносы КАК Взносы
	|ГДЕ
	|	Взносы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Взносы.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо,
	|	Удержания.Подразделение,
	|	Удержания.НаправлениеДеятельности
	|ИЗ
	|	ВТУдержаннаяЗарплата КАК Удержания
	|ГДЕ
	|	Удержания.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Удержания.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Займы.ФизическоеЛицо,
	|	Займы.Подразделение,
	|	Займы.НаправлениеДеятельности
	|ИЗ
	|	ВТЗаймы КАК Займы
	|ГДЕ
	|	Займы.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Займы.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Обучение.ФизическоеЛицо,
	|	Обучение.Подразделение,
	|	Обучение.НаправлениеДеятельности
	|ИЗ
	|	ВТОбучение КАК Обучение
	|ГДЕ
	|	Обучение.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Обучение.АналитикаРасходов = НЕОПРЕДЕЛЕНО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Подразделение,
	|	НаправлениеДеятельности";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачисленнаяЗарплата", Объект.НачисленнаяЗарплата.Выгрузить());
	Запрос.УстановитьПараметр("Взносы", Объект.Взносы.Выгрузить());
	Запрос.УстановитьПараметр("УдержаннаяЗарплата", Объект.УдержаннаяЗарплата.Выгрузить());
	Запрос.УстановитьПараметр("Займы", Объект.Займы.Выгрузить());
	Запрос.УстановитьПараметр("Обучение", Объект.Обучение.Выгрузить());
	Запрос.Выполнить();
	
	СоздатьВТАналитикаДругихДокументов(МенеджерВременныхТаблиц, Объект.Ссылка, Объект.Дата);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикаДругихДокументов.ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности,
	|	АналитикаДругихДокументов.СтатьяРасходов,
	|	АналитикаДругихДокументов.АналитикаРасходов
	|ИЗ
	|	ВТЗаполненнаяАналитика КАК АналитикаДругихДокументов";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ФизическоеЛицо, Подразделение, НаправлениеДеятельности");
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("НачисленнаяЗарплата");
	ИменаТаблиц.Добавить("Взносы");
	ИменаТаблиц.Добавить("УдержаннаяЗарплата");
	ИменаТаблиц.Добавить("Займы");
	ИменаТаблиц.Добавить("Обучение");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, Выборка);
		Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
			НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.СтатьяРасходов = Выборка.СтатьяРасходов;
				НайденнаяСтрока.АналитикаРасходов = Выборка.АналитикаРасходов;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьВТАналитикаДругихДокументов(МенеджерВременныхТаблиц, ТекущийДокумент, ДатаАктуальности)
	
	// Получаем последние используемые значения по совпадающим сочетаниям заполненных полей.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АналитикаДругихДокументов.Ссылка,
	|	АналитикаДругихДокументов.НомерСтроки КАК НомерСтроки,
	|	АналитикаДругихДокументов.НомерТаблицы,
	|	АналитикаДругихДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение КАК Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	АналитикаДругихДокументов.СтатьяРасходов,
	|	АналитикаДругихДокументов.АналитикаРасходов
	|ПОМЕСТИТЬ ВТАналитикаДругихДокументов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачисленнаяЗарплата.Ссылка КАК Ссылка,
	|		НачисленнаяЗарплата.НомерСтроки КАК НомерСтроки,
	|		1 КАК НомерТаблицы,
	|		НачисленнаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|		НачисленнаяЗарплата.Подразделение КАК Подразделение,
	|		НачисленнаяЗарплата.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		НачисленнаяЗарплата.СтатьяРасходов КАК СтатьяРасходов,
	|		НачисленнаяЗарплата.АналитикаРасходов КАК АналитикаРасходов
	|	ИЗ
	|		Документ.ОтражениеРасходовНаПерсонал.НачисленнаяЗарплата КАК НачисленнаяЗарплата
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
	|			ПО НезаполненнаяАналитика.ФизическоеЛицо = НачисленнаяЗарплата.ФизическоеЛицо
	|			И НезаполненнаяАналитика.Подразделение = НачисленнаяЗарплата.Подразделение
	|			И НезаполненнаяАналитика.НаправлениеДеятельности = НачисленнаяЗарплата.НаправлениеДеятельности
	|	ГДЕ
	|		НачисленнаяЗарплата.Ссылка <> &ТекущийДокумент
	|		И НачисленнаяЗарплата.Ссылка.Дата <= &ДатаАктуальности
	|		И НачисленнаяЗарплата.Ссылка.Проведен
	|		И НачисленнаяЗарплата.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Взносы.Ссылка,
	|		Взносы.НомерСтроки,
	|		2,
	|		Взносы.ФизическоеЛицо,
	|		Взносы.Подразделение,
	|		Взносы.НаправлениеДеятельности,
	|		Взносы.СтатьяРасходов,
	|		Взносы.АналитикаРасходов
	|	ИЗ
	|		Документ.ОтражениеРасходовНаПерсонал.Взносы КАК Взносы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
	|			ПО НезаполненнаяАналитика.ФизическоеЛицо = Взносы.ФизическоеЛицо
	|			И НезаполненнаяАналитика.Подразделение = Взносы.Подразделение
	|			И НезаполненнаяАналитика.НаправлениеДеятельности = Взносы.НаправлениеДеятельности
	|	ГДЕ
	|		Взносы.Ссылка <> &ТекущийДокумент
	|		И Взносы.Ссылка.Дата <= &ДатаАктуальности
	|		И Взносы.Ссылка.Проведен
	|		И Взносы.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УдержаннаяЗарплата.Ссылка,
	|		УдержаннаяЗарплата.НомерСтроки,
	|		3,
	|		УдержаннаяЗарплата.ФизическоеЛицо,
	|		УдержаннаяЗарплата.Подразделение,
	|		УдержаннаяЗарплата.НаправлениеДеятельности,
	|		УдержаннаяЗарплата.СтатьяРасходов,
	|		УдержаннаяЗарплата.АналитикаРасходов
	|	ИЗ
	|		Документ.ОтражениеРасходовНаПерсонал.УдержаннаяЗарплата КАК УдержаннаяЗарплата
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
	|			ПО НезаполненнаяАналитика.ФизическоеЛицо = УдержаннаяЗарплата.ФизическоеЛицо
	|			И НезаполненнаяАналитика.Подразделение = УдержаннаяЗарплата.Подразделение
	|			И НезаполненнаяАналитика.НаправлениеДеятельности = УдержаннаяЗарплата.НаправлениеДеятельности
	|	ГДЕ
	|		УдержаннаяЗарплата.Ссылка <> &ТекущийДокумент
	|		И УдержаннаяЗарплата.Ссылка.Дата <= &ДатаАктуальности
	|		И УдержаннаяЗарплата.Ссылка.Проведен
	|		И УдержаннаяЗарплата.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Займы.Ссылка,
	|		Займы.НомерСтроки,
	|		4,
	|		Займы.ФизическоеЛицо,
	|		Займы.Подразделение,
	|		Займы.НаправлениеДеятельности,
	|		Займы.СтатьяРасходов,
	|		Займы.АналитикаРасходов
	|	ИЗ
	|		Документ.ОтражениеРасходовНаПерсонал.Займы КАК Займы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
	|			ПО НезаполненнаяАналитика.ФизическоеЛицо = Займы.ФизическоеЛицо
	|			И НезаполненнаяАналитика.Подразделение = Займы.Подразделение
	|			И НезаполненнаяАналитика.НаправлениеДеятельности = Займы.НаправлениеДеятельности
	|	ГДЕ
	|		Займы.Ссылка <> &ТекущийДокумент
	|		И Займы.Ссылка.Дата <= &ДатаАктуальности
	|		И Займы.Ссылка.Проведен
	|		И Займы.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Обучение.Ссылка,
	|		Обучение.НомерСтроки,
	|		5,
	|		Обучение.ФизическоеЛицо,
	|		Обучение.Подразделение,
	|		Обучение.НаправлениеДеятельности,
	|		Обучение.СтатьяРасходов,
	|		Обучение.АналитикаРасходов
	|	ИЗ
	|		Документ.ОтражениеРасходовНаПерсонал.Обучение КАК Обучение
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНезаполненнаяАналитика КАК НезаполненнаяАналитика
	|			ПО НезаполненнаяАналитика.ФизическоеЛицо = Обучение.ФизическоеЛицо
	|			И НезаполненнаяАналитика.Подразделение = Обучение.Подразделение
	|			И НезаполненнаяАналитика.НаправлениеДеятельности = Обучение.НаправлениеДеятельности
	|	ГДЕ
	|		Обучение.Ссылка <> &ТекущийДокумент
	|		И Обучение.Ссылка.Дата <= &ДатаАктуальности
	|		И Обучение.Ссылка.Проведен
	|		И Обучение.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)) КАК
	|		АналитикаДругихДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Подразделение,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаДругихДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение КАК Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МАКСИМУМ(АналитикаДругихДокументов.Ссылка) КАК Ссылка,
	|	МАКСИМУМ(АналитикаДругихДокументов.НомерСтроки) КАК НомерСтроки,
	|	МИНИМУМ(АналитикаДругихДокументов.НомерТаблицы) КАК НомерТаблицы
	|ПОМЕСТИТЬ ВТЕдинственныеЗначения
	|ИЗ
	|	ВТАналитикаДругихДокументов КАК АналитикаДругихДокументов
	|СГРУППИРОВАТЬ ПО
	|	АналитикаДругихДокументов.ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Подразделение,
	|	НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаДругихДокументов.ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности,
	|	АналитикаДругихДокументов.СтатьяРасходов,
	|	АналитикаДругихДокументов.АналитикаРасходов
	|ПОМЕСТИТЬ ВТЗаполненнаяАналитика
	|ИЗ
	|	ВТАналитикаДругихДокументов КАК АналитикаДругихДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЕдинственныеЗначения КАК ЕдинственныеЗначения
	|		ПО АналитикаДругихДокументов.ФизическоеЛицо = ЕдинственныеЗначения.ФизическоеЛицо
	|		И АналитикаДругихДокументов.Подразделение = ЕдинственныеЗначения.Подразделение
	|		И АналитикаДругихДокументов.НаправлениеДеятельности = ЕдинственныеЗначения.НаправлениеДеятельности
	|		И АналитикаДругихДокументов.Ссылка = ЕдинственныеЗначения.Ссылка
	|		И АналитикаДругихДокументов.НомерТаблицы = ЕдинственныеЗначения.НомерТаблицы
	|		И АналитикаДругихДокументов.НомерСтроки = ЕдинственныеЗначения.НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатьяРасходовАналитикаПоУмолчанию(ФизическоеЛицо, Подразделение, НаправлениеДеятельности, ТекущийДокумент, ДатаАктуальности)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ФизическоеЛицо КАК ФизическоеЛицо,
	|	&Подразделение КАК Подразделение,
	|	&НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ ВТНезаполненнаяАналитика";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	Запрос.Выполнить();
	
	СоздатьВТАналитикаДругихДокументов(МенеджерВременныхТаблиц, ТекущийДокумент, ДатаАктуальности);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АналитикаДругихДокументов.ФизическоеЛицо,
	|	АналитикаДругихДокументов.Подразделение,
	|	АналитикаДругихДокументов.НаправлениеДеятельности,
	|	АналитикаДругихДокументов.СтатьяРасходов,
	|	АналитикаДругихДокументов.АналитикаРасходов
	|ИЗ
	|	ВТЗаполненнаяАналитика КАК АналитикаДругихДокументов";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатьяАналитикаРасходов = Новый Структура("СтатьяРасходов, АналитикаРасходов");
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтатьяАналитикаРасходов, Выборка);
	КонецЕсли;
	
	Возврат СтатьяАналитикаРасходов;
	
КонецФункции	

&НаКлиенте
Процедура УстановитьСтатьиРасходовВТабличнойЧасти(ТабличнаяЧасть, ВыделенныеСтроки)
	
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("УстановитьСтатьиРасходовВТабличнойЧастиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиРасходов.Форма.ФормаВыбораСтатьиИАналитики", , ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатьиРасходовВТабличнойЧастиЗавершение(Структура, ДополнительныеПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Структура) Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть;
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(Строка);
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы.СтатьяРасходов = Структура.СтатьяРасходов;
				СтрокаТаблицы.АналитикаРасходов = Структура.АналитикаРасходов;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			СтрокаТаблицы.СтатьяРасходов = Структура.СтатьяРасходов;
			СтрокаТаблицы.АналитикаРасходов = Структура.АналитикаРасходов;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваПоляПодразделения()
	
	ДоступенВводПодразделения = ЗаполнятьПоВсемПодразделениям = 0;
	
	Элементы.Подразделение.Доступность = ДоступенВводПодразделения;
	Элементы.Подразделение.АвтоОтметкаНезаполненного = ДоступенВводПодразделения;
	Элементы.Подразделение.ОтметкаНезаполненного = ДоступенВводПодразделения И Не ЗначениеЗаполнено(Объект.Подразделение);
	
	// Очищаем поле, если подразделение недоступно.
	Если Не ДоступенВводПодразделения Тогда
		Объект.Подразделение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(СтандартнаяОбработка, ВладелецФормыВыбора)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
		СтандартнаяОбработка = Ложь;
		МодульФинансовыйУчетКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ФинансовыйУчетКлиент");
		МодульФинансовыйУчетКлиент.ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(
			ЭтотОбъект, ВладелецФормыВыбора, Объект.ПериодРегистрации, КонецМесяца(Объект.ПериодРегистрации), Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораФизическогоЛица(ВыбранноеЗначение, СтандартнаяОбработка, ИдентификаторТекущейСтроки, ИмяТЧ)
	
	СтандартнаяОбработка = Ложь;
	
	Если ИдентификаторТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект[ИмяТЧ].НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекущиеДанные.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ФизическоеЛицо");
	Иначе
		ТекущиеДанные.ФизическоеЛицо = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

#Область КлючевыеРеквизитыЗаполненияФормы

&НаСервере
// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.НачисленнаяЗарплата");
	Массив.Добавить("Объект.Взносы");
	Массив.Добавить("Объект.УдержаннаяЗарплата");
	Массив.Добавить("Объект.Займы");
	Массив.Добавить("Объект.Обучение");
	Массив.Добавить("Объект.ФизическиеЛица");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецОбласти
